/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：buntu.h
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：v1.1
* 作    者：lhb Steven
* 完成日期：2016/3/14
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "buntu.h"
#include "Delay.h"
#include "Time.h"

#define BUT_OUT_PA  PA_IDR_IDR1
#define BUT_IN_PA   PA_IDR_IDR2
/**********************************************函数定义***************************************************** 
* 函数名称: void BuntuInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: 按键初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void BuntuInit(void) { 
    PA_DDR_DDR1 = 0;//出纸-步进
    PA_CR1_C11 = 0;
    PA_CR2_C21 = 0;
    
    PA_DDR_DDR2 = 0;//出纸-步进
    PA_CR1_C12 = 0;
    PA_CR2_C22 = 0;
}
/**********************************************函数定义***************************************************** 
* 函数名称: u8 BuntuRead(void) 
* 输入参数: void 
* 返回参数: u8  
* 功    能: 读取按键状态  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
u8 BuntuRead(void) { 
    if(BUT_OUT_PA == 0) {
        
    } else {
    
    }
    
    if(BUT_IN_PA == 0) {
        
    } else {
    
    }
}


