/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：led.c
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：v1.0
* 作    者：lhb Steven
* 完成日期：2016/3/14
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "Led.h"

#define LED_R   PC_ODR_ODR2

/**********************************************函数定义***************************************************** 
* 函数名称: void LedInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: led初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedInit(void) { 
    PB_DDR_DDR1 = 1;//状态指示灯
    PB_CR1_C11 = 1;
    PB_CR2_C21 = 1;
}










