/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/7/13
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#ifndef __MOTO_H
#define __MOTO_H

#include "Type.h"

typedef struct {//测试节省内存
    u8   bit0:1;
    u8   bit1:1;
    u8   bit2:1;
    u8   bit3:1;
    u8   bit4:1;
    u8   bit5:1;
    u8   bit6:1;
    u8   bit7:1;
}bitu8;

#define MOTO_PRP 0 //是否开启时间保护 0:关闭 1:开启

typedef enum {
    ste_best_arrive = 46000,//不经电机最大步数
    ste_dr_pla_positive = 1,//压纸电机正传 1
    ste_dr_pla_counter = 0,//压纸电机反转 0
    ste_dr_cut_positive = 0,//切纸电机正传 1
    ste_dr_cut_counter = 1,//切纸电机反转 0
    std_cut_up_pro_time = 30000,//切纸电机正传保护时间
    std_cut_down_pro_time = 30000,//切纸电机正传保护时间
    std_pla_up_pro_time = 830,//压纸电机正传保护时间
    std_pla_down_pro_time = 700,//压纸电机正传保护时间
	AUTO_CUT_TIME = 45000,//自动情况下，多久后自动跟刀
    STEP_SET_MM = 30,//走1毫米 需要走多少布
	//参数
}stepping_parameter;   

/*电机参数*/
typedef struct moto{
    u8 en;//电机使能
    u8 sleep_start;//是否开启电机
    u16 sleep_count;//速度计数
    u16 sleep;//电机速度
    u8 flag;//处于哪个环节
    u8 dir;//电机方向
    u8 zero_time_l;//切纸点击力度设置
    u16 zero_time;//切纸电机时间设置
    
    u8 cut_down_flag;//切纸停止

    u16 pla_hd_time;//电机转速保护
    u16 strength;//电机力度
}moto;
/*步进电机参数*/
typedef struct stepping{
    u8 en;//使能步进电机
    u8 sleep;//电机速度
    u8 dir;//电机方向
    u8 dr;//脉冲方向
    u8 arrive_en;//是否在走位置模式
    u16 arrive_setp;//需要走到的位置
    u8 setp;//走多少布是 0.1mm
    u16 position;//电机位置
    u16 position_last;//电机位置
    u16 updata;//步进电机位置更新
    u16 protection;//位置保护
}stepping;
/*自动模式参数*/
typedef struct autu {
    u8 en;//是否开启自动模式   
    u8 process;//处于什么状态  
    u16 time;//时间                
    u8 specal;//特殊标志位          
    u8 specal_rst;//特殊复位标志位     需要保存
    u8 push_book;//是否需要自动推书 0：不需要 1：需要   需要保存
    u16 sui_length;//等分模式每一段长度      需要保存
    u16 sui_length_book;//书本长度
    u8 sui_cut_num;//等分模式需要裁剪次数   需要保存
    u8 sui_cut_num_last;
    u8 specal_sui;//等分模式标志
    u8 specal_old;//老化模式
}autu;
/*蜂鸣器参数设置*/
typedef struct msuic {
	u8 open;//蜂鸣器是否打开
	u16 time;//蜂鸣器打开时间
}music;
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/13
************************************************************************************************************/ 
void MotoInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSetppingSet(u8 en, u8 dr,u8 set) 
* 输入参数: u8 en, u8 dr,u8 set 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/15
************************************************************************************************************/ 
void MotoSetppingSet(u8 mode , u8 dr, u16 arrive);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoServer(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/15
************************************************************************************************************/ 
void MotoServer(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSet(u8 moto, u8 sleep) 
* 输入参数: u8 moto, u8 sleep 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/14
************************************************************************************************************/ 
u8 MotoOpen(u8 moto, u8 dir);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoOff(u8 moto) 
* 输入参数: u8 moto 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/18
************************************************************************************************************/ 
void MotoOff(u8 moto);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoAuto(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/20
************************************************************************************************************/ 
void MusicSet(void);
/**********************************************函数定义***************************************************** 
* 函数名称: static void MotoSetDyn(u8 moto,u8 dyn) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/8/15
************************************************************************************************************/ 
u8 MotoSetDyn(u8 moto,u8 dyn);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoReset(void) 
* 输入参数: void
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/8/15
************************************************************************************************************/ 
void MotoReset(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuAutuSer(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: //自动模式结构体  
* 作    者: by lhb_steven
* 日    期: 2016/9/27
************************************************************************************************************/ 
void MenuAutuSer(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuAutoSet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 设置模式  
* 作    者: by lhb_steven
* 日    期: 2016/9/27
************************************************************************************************************/ 
void MenuAutoSet(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoAutuPushBook(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 是否需要自动推书设置  
* 作    者: by lhb_steven
* 日    期: 2016/9/28
************************************************************************************************************/ 
void MotoAutuPushBook(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoDivideSet(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能： 
* 作    者: by lhb_steven
* 日    期: 2016/8/20
************************************************************************************************************/ 
void MotoDivideSet(u8 num, u16 setp);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuAutuSui(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 开始等分模式  
* 作    者: by lhb_steven
* 日    期: 2016/9/28
************************************************************************************************************/ 
void MenuAutuSui(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: 打开或关闭 MotoOldMode(u8 cmd,u8 mode) 
* 输入参数: u8 cmd,u8 mode 
* 返回参数: 打开或关闭  
* 功    能: 老化模式  
* 作    者: by lhb_steven
* 日    期: 2016/9/29
************************************************************************************************************/ 
void MotoOldMode(u8 cmd,u8 mode);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSetStrength(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/29
************************************************************************************************************/ 
void MotoSetStrength(u8 cmd);

#endif


