/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/7/13
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#ifndef __MOTO_H
#define __MOTO_H

#include "Type.h"

typedef struct {//测试节省内存
    u8   bit0:1;
    u8   bit1:1;
    u8   bit2:1;
    u8   bit3:1;
    u8   bit4:1;
    u8   bit5:1;
    u8   bit6:1;
    u8   bit7:1;
}bitu8;

#define MOTO_PRP 0 //是否开启时间保护 0:关闭 1:开启

typedef enum {
    ste_best_arrive = 47000,//不经电机最大步数
    ste_dr_cut_positive = 0,//切纸电机正传 1
    ste_dr_cut_counter = 1,//切纸电机反转 0
    ste_dr_pla_positive = 0,//压纸电机正传 1
    ste_dr_pla_counter = 1,//压纸电机反转 0
    std_cut_up_pro_time = 60000,//切纸电机正传保护时间
    std_cut_down_pro_time = 60000,//切纸电机正传保护时间
    std_pla_up_pro_time = 60000,//压纸电机正传保护时间
    std_pla_down_pro_time = 60000,//压纸电机正传保护时间
	mot_zero_time = 60000,//步进电机慧琳
	
	//参数
}stepping_parameter;   

/*电机参数*/
typedef struct moto{
    u8 en;//电机使能
    u8 sleep_start;//是否开启电机
    u16 sleep_count;//速度计数
    u16 sleep;//电机速度
    u8 flag;//处于哪个环节
    u8 dir;//电机方向
    u8 sleep_set;//电机速度设置，即力度 10-90 九档
    u8 sleep_set_group;//电机速度档位-1-9
    u16 up_time;//正传保护时间
    u16 down_time;//反转保护时间
    u16 yazhi_jb;//压纸电机
    u16 close_time;//多久开始停止
    
    u8 cut_zero_time_l;//切纸点击力度设置
    u16 cut_zero_time;//切纸电机时间设置
}moto;
/*步进电机参数*/
typedef struct stepping{
    u8 en;//使能步进电机
    u16 sleep_count;//电机速度计数
    u16 sleep;//电机速度
    u16 step;//电机位置
    u8 dir;//电机方向
    u8 dr;//脉冲方向
    u8 step_count;//加速度
    u8 arrive_en;//是否在走位置模式
    u16 arrive_setp;//需要走到的位置
    u8 start_zero;//需要走到位置
	u16 zero_time;//超时保护
    
    u8 divide_sec;//第一次进入
    u8 divide_num;//需要走几次
    u16 divide_step;//每次需要走的位置
}stepping;
/*蜂鸣器参数设置*/
typedef struct msuic {
	u8 open;//蜂鸣器是否打开
	u16 time;//蜂鸣器打开时间
}music;
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/13
************************************************************************************************************/ 
void MotoInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSetppingSet(u8 en, u8 dr,u8 set) 
* 输入参数: u8 en, u8 dr,u8 set 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/15
************************************************************************************************************/ 
void MotoSetppingSet(u8 en, u8 dr,u8 set);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoServer(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/15
************************************************************************************************************/ 
void MotoServer(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSet(u8 moto, u8 sleep) 
* 输入参数: u8 moto, u8 sleep 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/14
************************************************************************************************************/ 
u8 MotoSet(u8 moto, u8 sleep, u8 dir);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoOff(u8 moto) 
* 输入参数: u8 moto 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/18
************************************************************************************************************/ 
void MotoOff(u8 moto);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoSteppingSetp(u8 mode, u8 arrive) 
* 输入参数: u8 mode, u8 arrive 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/20
************************************************************************************************************/ 
void MotoSteppingSetp(u8 mode, u16 arrive);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoAuto(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/20
************************************************************************************************************/ 
void MotoAuto(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void MusicSet(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/8/12
************************************************************************************************************/ 
void MusicSet(void);
/**********************************************函数定义***************************************************** 
* 函数名称: static void MotoSetDyn(u8 moto,u8 dyn) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/8/15
************************************************************************************************************/ 
u8 MotoSetDyn(u8 moto,u8 dyn);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoReset(void) 
* 输入参数: void
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/8/15
************************************************************************************************************/ 
void MotoReset(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoAgeTest(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能：0 关闭老化模式 1：开始老化模式
* 作    者: by lhb_steven
* 日    期: 2016/8/20
************************************************************************************************************/ 
void MotoAgeTest(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void MotoDivideSet(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能： 
* 作    者: by lhb_steven
* 日    期: 2016/8/20
************************************************************************************************************/ 
void MotoDivideSet(u8 num, u16 setp);

#endif


